node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2520
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2520
          }
        }
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_260.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_79.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_201.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_113.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_151.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_95.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_243.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_213.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_46.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_67.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_26.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_107.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_217.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_183.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_15.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_168.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_46.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_143.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_298.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_76.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_31.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_178.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_213.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_231.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_232.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_29.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_114.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_58.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_218.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_76.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_13.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_289.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_200.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_115.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_243.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_81.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_156.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_136.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_184.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_277.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_163.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_100.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_89.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_2.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_50.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_67.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_293.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_286.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_4.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_130.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_243.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_267.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_266.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_253.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_210.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_268.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_44.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_36.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_72.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_129.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_45.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_138.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_244.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_142.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_286.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_265.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_211.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_30.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_66.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_48.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_6.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_95.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_146.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_300.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_67.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_275.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_126.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_260.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_49.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_134.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_226.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_128.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_84.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_157.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_76.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_298.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_66.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_222.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_151.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_80.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_297.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_159.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_147.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_154.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_29.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_112.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_283.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_288.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_19.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_202.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_108.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_77.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_87.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_130.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_75.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_192.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_248.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_211.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_45.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_199.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_218.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_66.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_294.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_83.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_139.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_206.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_247.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_96.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_298.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_157.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_43.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_250.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_78.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_119.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_249.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_192.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_150.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_37.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_114.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_103.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_57.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_218.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_261.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_143.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_156.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_166.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_275.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_89.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_194.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_249.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_64.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_64.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_230.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_139.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_293.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_74.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_287.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_119.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_70.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_183.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_175.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_290.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_162.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_223.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_27.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_296.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_257.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_35.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_124.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_54.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_34.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_226.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_73.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_32.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_18.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_74.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_270.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_175.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_128.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_121.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_246.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_91.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_165.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_11.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_165.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_47.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_121.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_299.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_241.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_163.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_36.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_173.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_68.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_60.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_186.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_114.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_223.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_263.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_90.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_278.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_264.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_115.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_227.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_205.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_258.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_35.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_9.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_63.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_88.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_228.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_73.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_206.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_264.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_289.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_132.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_101.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_256.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_26.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_181.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_121.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_215.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_153.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_1.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_94.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_168.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_78.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_39.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_230.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_68.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_15.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_261.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_115.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_228.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_180.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_254.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_6.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_185.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_248.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_164.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_237.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_34.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_124.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_293.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_174.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_70.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_63.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_99.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_204.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_201.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_67.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_220.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_235.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_22.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_94.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_162.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_119.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_94.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_225.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_269.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_116.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_121.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_118.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_224.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_79.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_19.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_132.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_152.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_265.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_126.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_51.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_71.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_293.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_163.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_234.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_288.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_246.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_32.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_284.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_185.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_261.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_154.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_140.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_131.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_94.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_154.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_83.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_221.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_75.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_120.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_280.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_199.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_185.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_218.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_255.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_251.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_274.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_203.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_166.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_76.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_207.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_238.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_46.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_82.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_108.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_227.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_291.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_201.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_78.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_62.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_250.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_119.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_243.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_219.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_143.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_219.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_272.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_110.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_77.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_50.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_270.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_281.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_257.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_220.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_15.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_269.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_137.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_145.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_108.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_133.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_142.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_52.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_137.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_231.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_239.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_168.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_257.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_98.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_48.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_71.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_245.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_216.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_135.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_5.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_300.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_287.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_262.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_255.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_149.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_276.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_264.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_77.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_227.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_132.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_284.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_174.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_62.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_93.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_234.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_146.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_125.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_18.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_207.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_39.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_184.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_62.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_215.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_248.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_189.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_77.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_193.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_69.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_182.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_221.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_79.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_296.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_241.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_233.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Pa\\Pa_93.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_125.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\PS\\PS_209.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_135.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_300.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_292.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_102.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_109.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_133.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_228.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_296.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_287.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\RS\\RS_58.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\In\\In_43.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Cr\\Cr_99.jpg"
        string_val: "E:\\PythonProject\\System\\system\\user_data\\test\\datasets\\NEU-CLS\\train\\Sc\\Sc_119.jpg"
