{"modelTopology": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block1_conv1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv2D", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block1_conv2", "trainable": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "trainable": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv2D", "config": {"filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block2_conv1", "trainable": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv2D", "config": {"filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block2_conv2", "trainable": true}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "trainable": true}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv2D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block3_conv1", "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv2D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block3_conv2", "trainable": true}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "class_name": "Conv2D", "config": {"filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block3_conv3", "trainable": true}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "trainable": true}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block4_conv1", "trainable": true}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block4_conv2", "trainable": true}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block4_conv3", "trainable": true}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "trainable": true}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block5_conv1", "trainable": true}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block5_conv2", "trainable": true}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "class_name": "Conv2D", "config": {"filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "block5_conv3", "trainable": true}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "trainable": true}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "global_max_pooling2d_1", "class_name": "GlobalMaxPooling2D", "config": {"data_format": "channels_last", "name": "global_max_pooling2d_1", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_3", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "tfjs-layers 1.1.0", "backend": "tensor_flow.js"}}